Revit 2026 API

# SpaceUnboundedHeight Property

---

Get the Unbounded Height of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double UnboundedHeight { get; }
```
```vb
Public ReadOnly Property UnboundedHeight As Double
	Get
```
```cpp
public:
property double UnboundedHeight {
	double get ();
}
```
```fsharp
member UnboundedHeight : float with get
```

#### Property Value

Double

This property is used to get the Unbounded Height of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace